УТ/src/InformationRegisters/CRM_ЗаполненностьРеквизитовОбъектов/CRM_ЗаполненностьРеквизитовОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_ЗаполненностьРеквизитовОбъектов</name>
  <resources>
    <name>ПроцентЗаполненностиОбщий</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаРасчета</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ТребуетсяПересчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.Партнеры</types>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Правило</name>
    <type>
      <types>CatalogRef.CRM_ПравилаРасчетаКачестваЗаполненияДанных</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ/src/Catalogs/Партнеры/Партнеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Партнеры</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>НашеПредприятие</name>
      <description>Наше предприятие</description>
    </items>
    <items>
      <name>НеизвестныйПартнер</name>
      <description>Неизвестный партнер</description>
    </items>
    <items>
      <name>РозничныйПокупатель</name>
      <description>Розничный покупатель</description>
    </items>
  </predefined>
  <attributes>
    <name>БизнесРегион</name>
    <comment>Используется для группировки по территориальному признаку</comment>
    <type>
      <types>CatalogRef.БизнесРегионы</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДоступа</name>
    <type>
      <types>CatalogRef.ГруппыДоступаПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <comment>Используется при анализе первичного интереса</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <comment>Клиенты</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <comment>Поставщики</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>Публичное наименование, например, для печати или устного обращения.</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойМенеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Конкурент</name>
    <comment>Конкуренты</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрочиеОтношения</name>
    <comment>Прочие отношения</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбслуживаетсяТорговымиПредставителями</name>
    <comment>Обслуживаются торговыми представителями</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <comment>Перевозчики</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонЭтикетки</name>
    <type>
      <types>CatalogRef.ШаблоныЭтикетокИЦенников</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <type>
      <types>EnumRef.КомпанияЧастноеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеПереработчика</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантОтправкиЭлектронногоЧека</name>
    <type>
      <types>EnumRef.ВариантыОтправкиЭлектронногоЧекаПокупателю</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаДоставки</name>
    <type>
      <types>CatalogRef.ЗоныДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦен</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндивидуальныйВидЦены</name>
    <comment>Уточняющий или индивидуальный вид цены</comment>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Автор</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Важность</name>
    <comment>Важность клиента</comment>
    <type>
      <types>CatalogRef.CRM_ВажностьКлиентов</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Имя</name>
    <comment>Имя клиента</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_НапоминатьОДнеРождения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ОсновнаяОтрасль</name>
    <type>
      <types>CatalogRef.CRM_Отрасли</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ОсновноеКонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ОсновнойАдрес</name>
    <type>
      <types>CatalogRef.CRM_АдресаОфисовКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ОтписалсяОтEmailРассылок</name>
    <comment>Отписался от рассылок</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Отчество</name>
    <comment>Отчество клиента частное лицо</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Потенциал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СегментРынка</name>
    <comment>Сегмент рынка клиента</comment>
    <type>
      <types>CatalogRef.CRM_СегментыРынка</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СтатусРаботы</name>
    <comment>Статус работы с клиентом</comment>
    <type>
      <types>CatalogRef.CRM_СтатусыРаботыСКлиентом</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ТипОтношенийПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Фамилия</name>
    <comment>Фамилия клиента частное лицо</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ФизЛицо</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Фотография</name>
    <comment>Фотография клиента частное лицо</comment>
    <type>
      <types>CatalogRef.ПартнерыПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ЧисленностьРабочихМест</name>
    <comment>Численность рабочих мест клиента</comment>
    <type>
      <types>CatalogRef.CRM_ЧисленностьРабочихМестКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ЧисленностьСотрудников</name>
    <comment>Численность сотрудников клиента</comment>
    <type>
      <types>CatalogRef.CRM_ЧисленностьСотрудниковКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>сфпCoMagicID</name>
    <comment>Идентификатор контакта в системе CoMagic</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>сфпПользовательДляПереключенияЗвонков</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьCRM_Госорганы</name>
    <comment>Клиент является государственной организацией</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьCRM_Учредитель</name>
    <comment>Клиент является учредителем</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>CRM_ОсновнойДляСвязи</name>
      <comment>Основной вид контактной информации для связи</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>сфпВремяЗадержкиНабораДобавочногоНомера</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>сфпПрефиксНабора</name>
      <type>
        <types>CatalogRef.сфпПрефиксыИсходящихВызовов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_ВидыДеятельности</name>
    <attributes>
      <name>ВидДеятельности</name>
      <type>
        <types>CatalogRef.CRM_Отрасли</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтактноеЛицо</name>
      <type>
        <types>CatalogRef.КонтактныеЛицаПартнеров</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_ДополнительнаяИнформация</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.CRM_ДополнительнаяИнформация</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.CRM_ДополнительнаяИнформация</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРегистрации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_Теги</name>
    <attributes>
      <name>Тег</name>
      <type>
        <types>CatalogRef.CRM_Теги</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_ТипыОтношений</name>
    <attributes>
      <name>ТипОтношений</name>
      <type>
        <types>CatalogRef.CRM_ТипыОтношений</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ/src/InformationRegisters/CRM_ЗаполненностьРеквизитовОбъектов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Процедура выполняет добавление записи.
//
// Параметры:
//  Объект				 - СправочникСсылка.Партнеры, СправочникСсылка.КонтактныеЛицаПартнеров	 - Объект.
//  Правило				 - СправочникСсылка.CRM_ПравилаРасчетаКачестваЗаполненияДанных	 - Правило.
//  ПроцентЗаполнения	 - Число	 - Процент заполнения.
//  ДатаРасчета			 - Дата	 - Дата расчета.
//  ТребуетсяПересчет	 - Булево	 - Требуется пересчет.
//  Комментарий			 - Строкеа	 - Комментарий.
//
Процедура ДобавитьЗапись(Объект = Неопределено, Правило = Неопределено, ПроцентЗаполнения = 0, ДатаРасчета = Неопределено, ТребуетсяПересчет = Ложь, Комментарий = "") Экспорт

	Если Не ЗначениеЗаполнено(Объект)
		И Не ЗначениеЗаполнено(Правило)	Тогда
		Возврат;
	ИначеЕсли Не ТребуетсяПересчет
		И Не ЗначениеЗаполнено(Объект) Тогда
		Возврат;	
	КонецЕсли;                      	
	
	Если ЗначениеЗаполнено(Объект) Тогда
		
		Если Не ЗначениеЗаполнено(ДатаРасчета) Тогда
			ДатаРасчета = ТекущаяДата();	
		КонецЕсли;
	
		НЗ = РегистрыСведений.CRM_ЗаполненностьРеквизитовОбъектов.СоздатьНаборЗаписей();
		НЗ.Отбор.Объект.Установить(Объект);
		
		НЗ.Прочитать();
		НЗ.Очистить();
		
		Запись = НЗ.Добавить();
		Запись.Объект = Объект;
		Запись.Правило = Правило;
		Запись.ПроцентЗаполненностиОбщий = ПроцентЗаполнения;
		Запись.ДатаРасчета = ДатаРасчета;
		Запись.ТребуетсяПересчет = ТребуетсяПересчет;
		Запись.Комментарий = Комментарий;
		
		НЗ.Записать();
		
	Иначе
		МЗ = РегистрыСведений.CRM_ЗаполненностьРеквизитовОбъектов.СоздатьМенеджерЗаписи();
		МЗ.Объект = Неопределено;
		МЗ.Правило = Правило;
		
		Если ЗначениеЗаполнено(ДатаРасчета) Тогда
			МЗ.Прочитать();
			Если МЗ.Выбран() Тогда
				Если Не ЗначениеЗаполнено(МЗ.ДатаРасчета) Тогда
					// Текущая запись приоритетнее
					Возврат;
				КонецЕсли;
			Иначе
				МЗ.Объект = Неопределено;
				МЗ.Правило = Правило;	
			КонецЕсли;
		КонецЕсли;
		
		МЗ.ДатаРасчета = ДатаРасчета;
		МЗ.ТребуетсяПересчет = Истина;
				
		МЗ.Записать();
	
	КонецЕсли; 	

КонецПроцедуры
 
// Процедура выполняет удаление записи по правилу.
//
// Параметры:
//  Правило	 - СправочникСсылка.CRM_ПравилаРасчетаКачестваЗаполненияДанных	 - Правило.
//
Процедура УдалитьЗаписьПоПравилу(Правило) Экспорт

	МЗ = РегистрыСведений.CRM_ЗаполненностьРеквизитовОбъектов.СоздатьМенеджерЗаписи();
	МЗ.Объект = Неопределено;
	МЗ.Правило = Правило;
	МЗ.Прочитать();
	
	Если МЗ.Выбран() Тогда
		МЗ.Удалить();
	КонецЕсли; 

КонецПроцедуры

// Процедура выполняет удаление всех записей по правилу.
//
// Параметры:
//  Правило	 - СправочникСсылка.CRM_ПравилаРасчетаКачестваЗаполненияДанных	 - Правило.
//
Процедура УдалитьВсеЗаписиПоПравилу(Правило) Экспорт

	НЗ = РегистрыСведений.CRM_ЗаполненностьРеквизитовОбъектов.СоздатьНаборЗаписей();
	НЗ.Отбор.Правило.Установить(Правило);
	НЗ.Очистить();
	НЗ.Записать();
	
КонецПроцедуры

// Функция возвращает объекты к расчету для массива объектов.
//
// Параметры:
//  МассивОбъектов	 - Массив	 - Массив объектов.
// 
// Возвращаемое значение:
//   - Соответствие
//
Функция ПолучитьОбъектыКРасчету_ДляМассиваОбъектов(МассивОбъектов) Экспорт
	
	Запрос = Новый Запрос;
	МВТ = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Партнеры.Ссылка КАК Объект
	|ПОМЕСТИТЬ ВТ_ОбъектыРС
	|ИЗ
	|	Справочник.Партнеры КАК Партнеры
	|ГДЕ
	|	Партнеры.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтактныеЛица.Ссылка
	|ИЗ
	|	Справочник.КонтактныеЛицаПартнеров КАК КонтактныеЛица
	|ГДЕ
	|	КонтактныеЛица.Ссылка В(&МассивОбъектов)";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Выполнить();
	
	Возврат ПолучитьОбъектыКРасчету(МВТ);
		
КонецФункции

// Функция возвращает объекты к расчету по размеру пакета.
//
// Параметры:
//  РазмерПакетаКПересчету	 - Число	 - Размер пакета к пересчету.
// 
// Возвращаемое значение:
//   - Соответствие
//
Функция ПолучитьОбъектыКРасчету_ПоРазмеруПакета(РазмерПакетаКПересчету = 1000) Экспорт
	
	Запрос = Новый Запрос;
	МВТ = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	Запрос.Текст = СтрШаблон(
	"ВЫБРАТЬ  ПЕРВЫЕ %1
	|	CRM_ЗаполненностьРеквизитовОбъектов.Объект КАК Объект
	|ПОМЕСТИТЬ ВТ_ОбъектыРС
	|ИЗ
	|	РегистрСведений.CRM_ЗаполненностьРеквизитовОбъектов КАК CRM_ЗаполненностьРеквизитовОбъектов
	|ГДЕ
	|	НЕ CRM_ЗаполненностьРеквизитовОбъектов.Объект = НЕОПРЕДЕЛЕНО
	|	И CRM_ЗаполненностьРеквизитовОбъектов.ТребуетсяПересчет", 
	Формат(РазмерПакетаКПересчету, "ЧДЦ=0; ЧН=0; ЧГ=0"));
	
	Запрос.Выполнить();
	
	Возврат ПолучитьОбъектыКРасчету(МВТ);
	
КонецФункции

// Функция возвращает объекты к расчету по правилам.
//
// Параметры:
//  РазмерПакетаКПересчету	 - Число	 - Размер пакета к пересчету.
// 
// Возвращаемое значение:
//   - Соответствие
//
Функция ПолучитьОбъектыКРасчетуПоПравилам(РазмерПакетаКПересчету = 1000) Экспорт

	СоответствиеОбъектыКРасчету = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 	  
	"ВЫБРАТЬ
	|	CRM_ЗаполненностьРеквизитовОбъектов.Правило КАК Правило,
	|	CRM_ЗаполненностьРеквизитовОбъектов.ДатаРасчета КАК ДатаРасчета
	|ИЗ
	|	РегистрСведений.CRM_ЗаполненностьРеквизитовОбъектов КАК CRM_ЗаполненностьРеквизитовОбъектов
	|ГДЕ
	|	CRM_ЗаполненностьРеквизитовОбъектов.Объект = НЕОПРЕДЕЛЕНО
	|	И CRM_ЗаполненностьРеквизитовОбъектов.ТребуетсяПересчет";	
	
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			МассивОбъектов = ПолучитьОбъектыКРасчетуПоПравилу(Выборка.Правило, Выборка.ДатаРасчета, РазмерПакетаКПересчету);
			СоответствиеОбъектыКРасчету.Вставить(Выборка.Правило, МассивОбъектов);		
		КонецЦикла;
	КонецЕсли;
	
	Возврат СоответствиеОбъектыКРасчету;
	
КонецФункции

// Функция возвращает объекты к расчету по правилу.
//
// Параметры:
//  Правило					 - СправочникСсылка.CRM_ПравилаРасчетаКачестваЗаполненияДанных
//  ДатаРасчета				 - Дата	 - Дата расчета.
//  РазмерПакетаКПересчету	 - Число	 - Размер пакета к пересчету.
// 
// Возвращаемое значение:
//   - Соответствие
//
Функция ПолучитьОбъектыКРасчетуПоПравилу(Правило, ДатаРасчета, РазмерПакетаКПересчету = 1000) Экспорт

	ДанныеПравила = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Правило, "ТипОбъекта, СтатусРаботыСКлиентом");
	
	Запрос = Новый Запрос;
	Запрос.Текст = СтрШаблон(	  
	"ВЫБРАТЬ ПЕРВЫЕ %1
	|	ОбъектДляРасчета.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.CRM_ПравилаРасчетаКачестваЗаполненияДанных КАК ПравилоРасчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ %2 КАК ОбъектДляРасчета
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_ЗаполненностьРеквизитовОбъектов КАК CRM_ЗаполненностьРеквизитовОбъектов
	|			ПО ОбъектДляРасчета.Ссылка = CRM_ЗаполненностьРеквизитовОбъектов.Объект
	|				И (CRM_ЗаполненностьРеквизитовОбъектов.ДатаРасчета > &ДатаРасчета
	|					ИЛИ &ДатаРасчета = ДАТАВРЕМЯ(1, 1, 1))
	|		ПО (ПравилоРасчета.Ссылка = &Правило)
	|			И (ОбъектДляРасчета.%3 = ПравилоРасчета.СтатусРаботыСКлиентом)
	|				И (НЕ ОбъектДляРасчета.ПометкаУдаления)
	|ГДЕ
	|	CRM_ЗаполненностьРеквизитовОбъектов.Объект ЕСТЬ NULL",
	Формат(РазмерПакетаКПересчету, "ЧДЦ=0; ЧН=0; ЧГ=0"),
	ДанныеПравила.ТипОбъекта,
	?(ДанныеПравила.ТипОбъекта = "Справочник.Партнеры", "CRM_СтатусРаботы", "Владелец.CRM_СтатусРаботы"));	
	
	Запрос.УстановитьПараметр("Правило", Правило);
	Запрос.УстановитьПараметр("ДатаРасчета", ДатаРасчета);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		
КонецФункции

// Функция возвращает данные расчета процента заполнения.
//
// Параметры:
//  СсылкаОбъектРасчета	 - СправочникСсылка.Партнеры, СправочникСсылка.КонтактныеЛицаПартнеров	 - Ссылка объекта расчета.
// 
// Возвращаемое значение:
//   - Структура, Неопределено
//
Функция ДанныеРасчетаПроцентаЗаполнения(СсылкаОбъектРасчета) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	CRM_ЗаполненностьРеквизитовОбъектов.Правило КАК Правило,
	|	CRM_ЗаполненностьРеквизитовОбъектов.Комментарий КАК Комментарий,
	|	CRM_ЗаполненностьРеквизитовОбъектов.ПроцентЗаполненностиОбщий КАК ПроцентЗаполненностиОбщий
	|ИЗ
	|	РегистрСведений.CRM_ЗаполненностьРеквизитовОбъектов КАК CRM_ЗаполненностьРеквизитовОбъектов
	|ГДЕ
	|	CRM_ЗаполненностьРеквизитовОбъектов.Объект = &ОбъектРасчета
	|	И НЕ CRM_ЗаполненностьРеквизитовОбъектов.ТребуетсяПересчет
	|	И CRM_ЗаполненностьРеквизитовОбъектов.Правило.ДатаИзменения < CRM_ЗаполненностьРеквизитовОбъектов.ДатаРасчета";
	Запрос.УстановитьПараметр("ОбъектРасчета", СсылкаОбъектРасчета);
	
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Если Выборка.Следующий() Тогда
			МассивВыполненныеУсловия = РаспарситьКомментарий(Выборка.Комментарий);
			
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ПравилаРасчета.Ссылка КАК Правило,
			|	ПравилаРасчета.УсловиеПредставлениеДляПользователя КАК УсловиеПредставление,
			|	ПравилаРасчета.Вес КАК Вес,
			|	ПравилаРасчета.НомерСтроки В (&ВыполненныеУсловия) КАК Выполнено,
			|	ПравилаРасчета.НомерСтроки КАК НомерСтроки
			|ИЗ
			|	Справочник.CRM_ПравилаРасчетаКачестваЗаполненияДанных.Правила КАК ПравилаРасчета
			|ГДЕ
			|	ПравилаРасчета.Ссылка = &Ссылка
			|
			|УПОРЯДОЧИТЬ ПО
			|	Выполнено УБЫВ,
			|	ПравилаРасчета.НомерСтроки";
			Запрос.УстановитьПараметр("Ссылка", Выборка.Правило);
			Запрос.УстановитьПараметр("ВыполненныеУсловия", МассивВыполненныеУсловия);
			
			ДанныеРасчета = Новый Структура("ПроцентЗаполнения, ДеталиРасчета",
				Выборка.ПроцентЗаполненностиОбщий,
				Запрос.Выполнить().Выгрузить());
				
			Возврат ДанныеРасчета;
		КонецЕсли;
	КонецЕсли; 
	
	Возврат Неопределено;

КонецФункции

// Функция возвращает массив частей комментария, разделенных по ";".
//
// Параметры:
//  Комментарий	 - Стрка	 - Комментарий.
// 
// Возвращаемое значение:
//   - Массив
//
Функция РаспарситьКомментарий(Комментарий) Экспорт
	
	МассивВыполненныеУсловия = Новый Массив;
	
	МассивКомментарий = СтрРазделить(Комментарий, ";", Ложь);
	Для каждого ТекЭлемент Из МассивКомментарий Цикл
		МассивВыполненныеУсловия.Добавить(Число(Лев(ТекЭлемент, СтрНайти(ТекЭлемент, ":") - 1)));
	КонецЦикла;
	
	Возврат МассивВыполненныеУсловия;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьОбъектыКРасчету(МВТ)
	
	СоответствиеОбъектыКРасчету = Новый Соответствие;

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВТ_ОбъектыРС.Объект КАК Объект,
	|	""Справочник.Партнеры"" КАК ТипОбъектаПравила,
	|	Партнеры.CRM_СтатусРаботы КАК СтатусРаботы
	|ПОМЕСТИТЬ ВТ_ОбъектыТипПравила
	|ИЗ
	|	ВТ_ОбъектыРС КАК ВТ_ОбъектыРС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Партнеры КАК Партнеры
	|		ПО ВТ_ОбъектыРС.Объект = Партнеры.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ОбъектыРС.Объект,
	|	""Справочник.КонтактныеЛицаПартнеров"",
	|	КонтактныеЛица.Владелец.CRM_СтатусРаботы
	|ИЗ
	|	ВТ_ОбъектыРС КАК ВТ_ОбъектыРС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров КАК КонтактныеЛица
	|		ПО ВТ_ОбъектыРС.Объект = КонтактныеЛица.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОбъектыТипПравила.Объект КАК Объект,
	|	ПравилаРасчета.Ссылка КАК Правило,
	|	0 КАК Приоритет
	|ПОМЕСТИТЬ ВТ_ОбъектыПравилаПриоритет
	|ИЗ
	|	ВТ_ОбъектыТипПравила КАК ВТ_ОбъектыТипПравила
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.CRM_ПравилаРасчетаКачестваЗаполненияДанных КАК ПравилаРасчета
	|		ПО ВТ_ОбъектыТипПравила.СтатусРаботы = ПравилаРасчета.СтатусРаботыСКлиентом
	|			И ВТ_ОбъектыТипПравила.ТипОбъектаПравила = ПравилаРасчета.ТипОбъекта
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОбъектыПравилаПриоритет.Объект КАК Объект,
	|	МАКСИМУМ(ВТ_ОбъектыПравилаПриоритет.Правило) КАК Правило
	|ПОМЕСТИТЬ ВТ_ОбъектыПравила
	|ИЗ
	|	ВТ_ОбъектыПравилаПриоритет КАК ВТ_ОбъектыПравилаПриоритет
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ВТ_ОбъектыПравилаПриоритет.Объект КАК Объект,
	|			МИНИМУМ(ВТ_ОбъектыПравилаПриоритет.Приоритет) КАК Приоритет
	|		ИЗ
	|			ВТ_ОбъектыПравилаПриоритет КАК ВТ_ОбъектыПравилаПриоритет
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВТ_ОбъектыПравилаПриоритет.Объект) КАК ВложенныйЗапрос
	|		ПО ВТ_ОбъектыПравилаПриоритет.Объект = ВложенныйЗапрос.Объект
	|			И ВТ_ОбъектыПравилаПриоритет.Приоритет = ВложенныйЗапрос.Приоритет
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ОбъектыПравилаПриоритет.Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОбъектыРС.Объект КАК Объект,
	|	ВТ_ОбъектыПравила.Правило КАК Правило
	|ИЗ
	|	ВТ_ОбъектыРС КАК ВТ_ОбъектыРС
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОбъектыПравила КАК ВТ_ОбъектыПравила
	|		ПО ВТ_ОбъектыРС.Объект = ВТ_ОбъектыПравила.Объект
	|ИТОГИ ПО
	|	Правило";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаПравило = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПравило.Следующий() Цикл
			МассивОбъекты = Новый Массив;
			Выборка = ВыборкаПравило.Выбрать();
			Пока Выборка.Следующий() Цикл
				МассивОбъекты.Добавить(Выборка.Объект);
			КонецЦикла; 
			
			СоответствиеОбъектыКРасчету.Вставить(ВыборкаПравило.Правило, МассивОбъекты);
		
		КонецЦикла;
	КонецЕсли; 
	
	Возврат СоответствиеОбъектыКРасчету;

КонецФункции

#Область ПереходНаНовуюВерсию

Процедура ОчиститьДанныеПриПереходеНаВерсию(Параметры) Экспорт
	Набор = СоздатьНаборЗаписей();
	Набор.Записать(Истина);
	
	Параметры.ОбработкаЗавершена = Истина;
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
